// 1)
// Написать программу – 
// тест экзамен на знание истории освоения космоса. 
// Пользователь должен отвечать на вопросы, которые появляются на зкране компьютера.
// Экзаменуемый, правильно ответивший на все вопросы получает за экзамен 5 баллов.
// За каждый правильный ответ оценка увеличивается на 1 балл.
// В программе для ввода ответов используется переменная i ,
// данные по успеваемости хранятся в переменной n,
// в качестве обработки условий используется if <>  <> else

let questions =['Какая наука изучает звёзды, Галактику, звёздное небо? \n1. Астрономия \n2. Астрофизика \n3. Астрология \n4. Астрофобия'

,'Кто был первым человеком, совершившим полёт в космос? \n1. Юлий Гагарин \n2. Юрий Гарарин \n3. Полина Гарарина \n4. Юрий Агарин'
,'В каком году был запущен первый искусственный спутник Земли? \n1. 1960 \n2. 1961 \n3. 1957 \n4. 1959'
,'Как назывался корабль, на котором совершил свой полет Ю. А. Гагарин? \n1. Шатл-0 \n2. Союз-1 \n3. Юпитер-1 \n4. Восток-1'
,'Когда был совершён первый в истории человечества полёт в космос? \n1. 1961 \n2. 1957 \n3. 1960 \n4. 1962']
let answers =[1,2,3,4,1]
let n=0
for(i=0;i<questions.length;i++){
    let a=prompt(questions[i],'')
    if(a==answers[i]){
        n++
    }
}
alert(`Ваш результат: ${n} балла(ов)`)


// 2)
// Написать программу преобразования цифр в слова,
// используя конструкцию case <> of 
// Например, в операторе описаны все числа от 0 до 9 
// и их соответствующее название на русском языке.
// При вводе числа 5 программа должна вывести на экран слово «пять».

alert('Покажу цифры прописью')

let int = +prompt('Введите число от 0 до 9','')

switch(int){
    case 0:alert('Ноль')
    break
    case 1:alert('Один')
    break
    case 2:alert('Два')
    break
    case 3:alert('Три')
    break
    case 4:alert('Четыре')
    break
    case 5:alert('Пять')
    break
    case 6:alert('Шесть')
    break
    case 7:alert('Семь')
    break
    case 8:alert('Восемь')
    break
    case 9:alert('Девять')
    break
    default:alert('Введен не верный вариант')

}
















